var calendarObject = [

[["1","21","٠١",true,["جشن نوروز/جشن سال نو","عید سعید فطر[ ۱ شوال ]","روز جهانی نوروز[ March 21 ]"],false],["2","22","٠٢",true,["عیدنوروز","تعطیل به مناسبت عید سعید فطر[ ۲ شوال ]"],false],["3","23","٠٣",true,["عیدنوروز","روز جهانی هواشناسی[ March 23 ]"],false],["4","24","٠٤",true,["عیدنوروز"],false],["5","25","٠٥",false,[],false],["6","26","٠٦",false,["روز امید، روز شادباش نویسی","زادروز اَشو زرتشت، اَبَراِنسان بزرگ تاریخ"],false],["7","27","٠٧",true,["روز جهانی تئاتر[ March 27 ]"],false],["8","28","٠٨",false,[],false],["9","29","٠٩",false,[],false],["10","30","١٠",false,["جشن آبانگاه"],false],["11","31","١١",false,[],false],["12","01","١٢",true,["روز جمهوری اسلامی"],false],["13","02","١٣",true,["جشن سیزده به در"],false],["14","03","١٤",true,[],false],["15","04","١٥",false,[],false],["16","05","١٦",false,[],false],["17","06","١٧",false,["سروش روز،جشن سروشگان"],false],["18","07","١٨",false,["روز جهانی بهداشت[ April 7 ]"],false],["19","08","١٩",false,["فروردین روز،جشن فروردینگان"],false],["20","09","٢٠",false,[],false],["21","10","٢١",true,[],false],["22","11","٢٢",false,[],false],["23","12","٢٣",false,["روز دندانپزشک"],false],["24","13","٢٤",false,[],false],["25","14","٢٥",true,["روز بزرگداشت عطار نیشابوری","شهادت امام جعفر صادق(ع)[ ۲۵ شوال ]"],false],["26","15","٢٦",false,[],false],["27","16","٢٧",false,[],false],["28","17","٢٨",true,[],false],["29","18","٢٩",false,["روز ارتش جمهوری اسلامی ایران"],false],["30","19","٠١",false,["ولادت حضرت معصومه (س)، روز دختران[ ۱ ذوالقعده ]","روز علوم آزمایشگاهی، زاد روز حکیم سید اسماعیل جرجانی"],false],["31","20","٠٢",false,[],false],["1","21","٠٣",false,[],true],["2","22","٠٤",false,[],true],["3","23","٠٥",false,[],true],["4","24","٠٦",true,[],true]],

[["29","18","٢٩",false,[],true],["30","19","٠١",false,[],true],["31","20","٠٢",false,[],true],["1","21","٠٣",false,["روز بزرگداشت سعدی"],false],["2","22","٠٤",false,["جشن گیاه آوری؛ روز زمین[ April 22 ]"],false],["3","23","٠٥",false,["روزبزرگداشت شیخ بهایی؛ روزملی کارآفرینی؛ روز معماری"],false],["4","24","٠٦",true,[],false],["5","25","٠٧",false,[],false],["6","26","٠٨",false,["فاجعه‌ی انفجارِ بندر عباس [ 1404 خورشیدی]"],false],["7","27","٠٩",false,["روز جهانی طراحی و گرافیک[ April 27 ]"],false],["8","28","١٠",false,[],false],["9","29","١١",false,["ولادت امام رضا (ع)[ ۱۱ ذوالقعده ]","روز ملی روانشناس و مشاور"],false],["10","30","١٢",false,["جشن چهلم نوروز؛ روز ملی خلیج فارس"],false],["11","01","١٣",true,["روزجهانیکارگر[ May 1 ]"],false],["12","02","١٤",false,["روز معلم"],false],["13","03","١٥",false,[],false],["14","04","١٦",false,[],false],["15","05","١٧",false,["جشن میانه بهار/جشن بهاربد؛ روز شیراز","روز جهانی ماما[ May 5 ]"],false],["16","06","١٨",false,[],false],["17","07","١٩",false,[],false],["18","08","٢٠",true,["روز جهانی صلیب سرخ و هلال احمر[ May 8 ]"],false],["19","09","٢١",false,[],false],["20","10","٢٢",false,[],false],["21","11","٢٣",false,[],false],["22","12","٢٤",false,["زادروز مریم میرزاخانی ریاضیدان ایرانی، روز جهانی زن در ریاضیات","روز جهانی پرستار[ May 12 ]"],false],["23","13","٢٥",false,[],false],["24","14","٢٦",false,[],false],["25","15","٢٧",true,["روز بزرگداشت فردوسی"],false],["26","16","٢٨",false,[],false],["27","17","٢٩",false,["روز ارتباطات و روابط عمومی","شهادت امام محمد تقی (ع)[ ۳۰ ذوالقعده ]"],false],["28","18","٠١",false,["روز بزرگداشت حکیم عمر خیام","روز جهانی موزه و میراث فرهنگی[ May 18 ]"],false],["29","19","٠٢",false,[],false],["30","20","٠٣",false,[],false],["31","21","٠٤",false,[],false],["1","22","٠٥",true,[],true]],

[["26","16","٢٨",false,[],true],["27","17","٢٩",false,[],true],["28","18","٠١",false,[],true],["29","19","٠٢",false,[],true],["30","20","٠٣",false,[],true],["31","21","٠٤",false,[],true],["1","22","٠٥",true,["روز بهره وری و بهینه سازی مصرف","روز بزرگداشت ملاصدرا"],false],["2","23","٠٦",false,["فروریختن ساختمان متروپل در آبادان"],false],["3","24","٠٧",false,["فتح خرمشهر در عملیات بیت المقدس و روز مقاومت، ایثار و پیروزی","شهادت امام محمد باقر(ع)[ ۷ ذوالحجه ]"],false],["4","25","٠٨",false,["روز دزفول، روز مقاومت و پایداری"],false],["5","26","٠٩",false,["روز عرفه[ ۹ ذوالحجه ]"],false],["6","27","١٠",true,["خرداد روز،جشن خردادگان","عید سعید قربان[ ۱۰ ذوالحجه ]"],false],["7","28","١١",false,[],false],["8","29","١٢",true,[],false],["9","30","١٣",false,[],false],["10","31","١٤",false,["روز جهانی بدون دخانیات[ May 31 ]"],false],["11","01","١٥",false,["ولادت امام علی النقی (ع)[ ۱۵ ذوالحجه ]"],false],["12","02","١٦",false,[],false],["13","03","١٧",false,[],false],["14","04","١٨",true,["رحلت حضرت امام خمینی","عید سعید غدیر خم[ ۱۸ ذوالحجه ]"],false],["15","05","١٩",true,["قیام 15 خرداد","روز جهانی محیط زیست[ June 5 ]"],false],["16","06","٢٠",false,["ولادت امام موسی کاظم(ع)[ ۲۰ ذوالحجه ]"],false],["17","07","٢١",false,[],false],["18","08","٢٢",false,[],false],["19","09","٢٣",false,[],false],["20","10","٢٤",false,["روز جهانی صنایع دستی[ June 10 ]"],false],["21","11","٢٥",false,[],false],["22","12","٢٦",true,["روز جهانی مبارزه با کار کودکان[ June 12 ]"],false],["23","13","٢٧",false,[],false],["24","14","٢٨",false,["روز جهانی اهدای خون[ June 14 ]"],false],["25","15","٢٩",false,["روز ملی گل وگیاه"],false],["26","16","٠١",false,["روز جهانی پدر[ June 16 ]"],false],["27","17","٠٢",false,["روز جهانی بیابان زدایی[ June 17 ]"],false],["28","18","٠٣",false,[],false],["29","19","٠٤",true,[],false],["30","20","٠٥",false,[],false],["31","21","٠٦",false,["سالروز زلزله رودبار و منجیل [1369خورشیدی]"],false],["1","22","٠٧",false,[],true],["2","23","٠٨",false,[],true],["3","24","٠٩",true,[],true],["4","25","١٠",true,[],true],["5","26","١١",true,[],true]],

[["30","20","٠٥",false,[],true],["31","21","٠٦",false,[],true],["1","22","٠٧",false,["جشن آب پاشونک، جشن آغاز تابستان"],false],["2","23","٠٨",false,[],false],["3","24","٠٩",true,["تاسوعای حسینی[ ۹ محرم ]"],false],["4","25","١٠",true,["عاشورای حسینی[ ۱۰ محرم ]"],false],["5","26","١١",true,["روز جهانی مبارزه با مواد مخدر[ June 26 ]"],false],["6","27","١٢",false,["شهادتامام زین العابدین (ع)[ ۱۲ محرم ]"],false],["7","28","١٣",false,["انفجار دفتر حزب جمهوری اسلامی؛ روز قوه قضاییه"],false],["8","29","١٤",false,["روز مبارزه با سلاح های شیمیایی و میکروبی"],false],["9","30","١٥",false,[],false],["10","01","١٦",false,["روز صنعت و معدن","زادروز بابک خرمدین، سپه‌سالار دلاور ایران","روز بزرگداشت صائب تبریزی"],false],["11","02","١٧",false,[],false],["12","03","١٨",true,["شلیک به پرواز 655 ایران ایر توسط ناو وینسنس [ 1367 خورشیدی ]"],false],["13","04","١٩",false,["جشن تیرگان، بزرگداشت کمان کشیدن جان‌فدای ایران، آرش کمانگیر بر فراز البرز"],false],["14","05","٢٠",false,["روز قلم"],false],["15","06","٢١",false,["جشن خام خواری"],false],["16","07","٢٢",false,[],false],["17","08","٢٣",false,[],false],["18","09","٢٤",false,[],false],["19","10","٢٥",true,[],false],["20","11","٢٦",false,[],false],["21","12","٢٧",false,[],false],["22","13","٢٨",false,["زادروز محمد خوارزمی، ریاضیدان و فیلسوف ایرانی و روز ملی فناوری اطلاعات"],false],["23","14","٢٩",false,[],false],["24","15","٣٠",false,[],false],["25","16","٠١",false,["روز بهزیستی و تامین اجتماعی"],false],["26","17","٠٢",true,[],false],["27","18","٠٣",false,["اعلام پذیرش قطعنامه 598 شورای امنیت از سوی ایران [ 1367 خورشیدی ]"],false],["28","19","٠٤",false,[],false],["29","20","٠٥",false,[],false],["30","21","٠٦",false,[],false],["31","22","٠٧",false,[],false],["1","23","٠٨",false,[],true],["2","24","٠٩",true,[],true]],

[["27","18","٠٣",false,[],true],["28","19","٠٤",false,[],true],["29","20","٠٥",false,[],true],["30","21","٠٦",false,[],true],["31","22","٠٧",false,[],true],["1","23","٠٨",false,[],false],["2","24","٠٩",true,[],false],["3","25","١٠",false,[],false],["4","26","١١",false,[],false],["5","27","١٢",false,[],false],["6","28","١٣",false,[],false],["7","29","١٤",false,["اَمرداد روز،جشناَمردادگان"],false],["8","30","١٥",false,["روز بزرگداشت شیخ شهاب الدین سهروردی"],false],["9","31","١٦",true,[],false],["10","01","١٧",false,["جشن چله تابستان","آغاز هفته جهانی شیردهی[ August 1 ]"],false],["11","02","١٨",false,[],false],["12","03","١٩",false,[],false],["13","04","٢٠",true,["اربعین حسینی[ ۲۰ صفر ]"],false],["14","05","٢١",false,["سالروز صدور فرمان مشروطیت"],false],["15","06","٢٢",false,[],false],["16","07","٢٣",true,[],false],["17","08","٢٤",false,["روز خبرنگار"],false],["18","09","٢٥",false,[],false],["19","10","٢٦",false,[],false],["20","11","٢٧",false,[],false],["21","12","٢٨",true,["رحلترسول اکرم؛شهادت امام حسن مجتبی (ع)[ ۲۸ صفر ]"],false],["22","13","٢٩",true,["شهادت امام رضا (ع)[ ۳۰ صفر ]","روز جهانی چپ دست ها[ August 13 ]"],false],["23","14","٠١",true,["هجرت پیامبر اکرم از مکه به مدینه[ ۱ ربیع الاول ]"],false],["24","15","٠٢",false,[],false],["25","16","٠٣",false,[],false],["26","17","٠٤",false,[],false],["27","18","٠٥",false,[],false],["28","19","٠٦",false,["سالروز وقایع ۲۸ مرداد پس از برکناری محمد مصدق‌السلطنه","سالروز فاجعه آتش زدن سینما رکس آبادان","روز جهانی عکاسی[ August 19 ]"],false],["29","20","٠٧",false,[],false],["30","21","٠٨",true,["شهادت امام حسن عسکری (ع)[ ۸ ربیع الاول ]"],false],["31","22","٠٩",false,[],false],["1","23","١٠",false,[],true],["2","24","١١",false,[],true],["3","25","١٢",false,[],true],["4","26","١٣",false,[],true],["5","27","١٤",false,[],true],["6","28","١٥",true,[],true]],

[["31","22","٠٩",false,[],true],["1","23","١٠",false,["روز بزرگداشت ابوعلی سینا و روز پزشک"],false],["2","24","١١",false,["آغاز هفته دولت"],false],["3","25","١٢",false,["میلاد رسول اکرم به روایت اهل سنت[ ۱۲ ربیع الاول ]"],false],["4","26","١٣",false,["زادروز کوروش بزرگ","شهریور روز،جشن شهریورگان"],false],["5","27","١٤",false,["روز بزرگداشت محمدبن زکریای رازی و روز داروساز"],false],["6","28","١٥",true,[],false],["7","29","١٦",false,[],false],["8","30","١٧",true,["انفجار در دفتر نخست‌وزیری جمهوری اسلامی ایران، روز مبارزه با تروریسم","میلاد رسول اکرم و امام جعفر صادق (ع)[ ۱۷ ربیع الاول ]"],false],["9","31","١٨",false,[],false],["10","01","١٩",false,[],false],["11","02","٢٠",false,["روز ملی صنعت چاپ"],false],["12","03","٢١",false,["سالروز شهادت رئیسعلی دلواری، سردار بزرگ میهن و فرمانده قیام جنوب علیه اشغالگران انگلیسی"],false],["13","04","٢٢",true,["روز بزرگداشت ابوریحان بیرونی"],false],["14","05","٢٣",false,[],false],["15","06","٢٤",false,[],false],["16","07","٢٥",false,[],false],["17","08","٢٦",false,[],false],["18","09","٢٧",false,[],false],["19","10","٢٨",false,["روز جهانی پیشگیری از خودکشی[ September 10 ]"],false],["20","11","٢٩",true,["حمله به برج‌های دوقلوی مرکز تجارت جهانی[ September 11 ]"],false],["21","12","٣٠",false,["روز سینما"],false],["22","13","٠١",false,[],false],["23","14","٠٢",false,[],false],["24","15","٠٣",false,[],false],["25","16","٠٤",false,[],false],["26","17","٠٥",false,[],false],["27","18","٠٦",true,["روز شعر و ادب پارسی وروز بزرگداشت استاد شهریار"],false],["28","19","٠٧",false,[],false],["29","20","٠٨",false,["ولادت امام حسن عسکری (ع)[ ۸ ربیع الثانی ]"],false],["30","21","٠٩",false,["روز جهانی صلح[ September 21 ]"],false],["31","22","١٠",false,["آغاز هفته دفاع مقدس","وفات حضرت معصومه (س)[ ۱۰ ربیع الثانی ]"],false],["1","23","١١",false,[],true],["2","24","١٢",false,[],true],["3","25","١٣",true,[],true]],

[["28","19","٠٧",false,[],true],["29","20","٠٨",false,[],true],["30","21","٠٩",false,[],true],["31","22","١٠",false,[],true],["1","23","١١",false,["آغاز حمله مغول به ایران در پاییز 598 خورشیدی"],false],["2","24","١٢",false,[],false],["3","25","١٣",true,[],false],["4","26","١٤",false,["روز گرامیداشت سربازان وطن"],false],["5","27","١٥",false,["روز جهانی جهانگردی[ September 27 ]"],false],["6","28","١٦",false,[],false],["7","29","١٧",false,["روز آتش نشانی و ایمنی","سقوط هواپیمای حامل جمعی از فرماندهان جنگ (کلاهدوز، نامجو، فلاحی، فکوری، جهان آرا) در سال 1360","روز بزرگداشت شمس تبریزی"],false],["8","30","١٨",false,["روزبزرگداشت مولوی","روز جهانی ناشنوایان[ September 30 ]","روز جهانی ترجمه و مترجم[ September 30 ]"],false],["9","01","١٩",false,["روز جهانی سالمندان[ October 1 ]"],false],["10","02","٢٠",true,["مهر روز،جشن مهرگان"],false],["11","03","٢١",false,[],false],["12","04","٢٢",false,["آغاز هفته جهانی فضا[ October 4 ]"],false],["13","05","٢٣",false,["روز جهانی معلم[ October 5 ]"],false],["14","06","٢٤",false,["روز دامپزشکی"],false],["15","07","٢٥",false,[],false],["16","08","٢٦",false,["روز ملی کودک"],false],["17","09","٢٧",true,["روز جهانی پست[ October 9 ]"],false],["18","10","٢٨",false,["روز جهانی مبارزه با حکم اعدام[ October 10 ]"],false],["19","11","٢٩",false,["روز جهانی دختر[ October 11 ]"],false],["20","12","٠١",false,["روز بزرگداشت حافظ"],false],["21","13","٠٢",false,["روز پیروزی کاوه و فریدون بر ضحاک"],false],["22","14","٠٣",false,["روز جهانی استاندارد[ October 14 ]"],false],["23","15","٠٤",false,["روز جهانی عصای سفید[ October 15 ]"],false],["24","16","٠٥",true,["ولادت حضرت زینب (س) و روز پرستار و بهورز[ ۵ جمادی الاول ]","روز جهانی غذا[ October 16 ]"],false],["25","17","٠٦",false,["روز جهانی ریشه کنی فقر[ October 17 ]"],false],["26","18","٠٧",false,["روز تربیت بدنی و ورزش"],false],["27","19","٠٨",false,[],false],["28","20","٠٩",false,["زادروز ستارخان ملقب به سردار ملی و از سرداران جنبش مشروطه ایران"],false],["29","21","١٠",false,["روز ملی کوهنورد"],false],["30","22","١١",false,[],false],["1","23","١٢",true,[],true]],

[["25","17","٠٦",false,[],true],["26","18","٠٧",false,[],true],["27","19","٠٨",false,[],true],["28","20","٠٩",false,[],true],["29","21","١٠",false,[],true],["30","22","١١",false,[],true],["1","23","١٢",true,["روز آمار و برنامه ریزی","روز بزرگداشت ابوالفضل بیهقی، تاریخ‌نگار و نویسنده ایرانی"],false],["2","24","١٣",false,[],false],["3","25","١٤",false,[],false],["4","26","١٥",false,[],false],["5","27","١٦",false,[],false],["6","28","١٧",false,[],false],["7","29","١٨",false,["سالروز ورود کوروش بزرگ به بابل در سال 539 پیش از میلاد"],false],["8","30","١٩",true,["روز ملی محیط بان"],false],["9","31","٢٠",false,[],false],["10","01","٢١",false,["آبان روز، جشن آبانگان"],false],["11","02","٢٢",false,[],false],["12","03","٢٣",false,[],false],["13","04","٢٤",false,[],false],["14","05","٢٥",false,["روز ملّی مازندران"],false],["15","06","٢٦",true,["جشن میانه پاییز"],false],["16","07","٢٧",false,[],false],["17","08","٢٨",false,[],false],["18","09","٢٩",false,["روز ملی کیفیت"],false],["19","10","٣٠",false,[],false],["20","11","٠١",false,[],false],["21","12","٠٢",false,[],false],["22","13","٠٣",true,["شهادت حضرت فاطمه زهرا (س)[ ۳ جمادی الثانیه ]"],false],["23","14","٠٤",false,["روز جهانی دیابت[ November 14 ]"],false],["24","15","٠٥",false,["روز کتاب و کتابخوانی"],false],["25","16","٠٦",false,[],false],["26","17","٠٧",false,["روز جهانی دانش آموز[ November 17 ]"],false],["27","18","٠٨",false,[],false],["28","19","٠٩",false,["روز جهانی آقایان[ November 19 ]"],false],["29","20","١٠",true,["روز جهانی کودک[ November 20 ]"],false],["30","21","١١",false,[],false],["1","22","١٢",false,[],true],["2","23","١٣",false,[],true],["3","24","١٤",false,[],true],["4","25","١٥",false,[],true],["5","26","١٦",false,[],true],["6","27","١٧",true,[],true]],

[["30","21","١١",false,[],true],["1","22","١٢",false,["آذر جشن"],false],["2","23","١٣",false,[],false],["3","24","١٤",false,[],false],["4","25","١٥",false,["روز جهانی مبارزه با خشونت علیه زنان[ November 25 ]"],false],["5","26","١٦",false,["روز بسیج مستضعفان"],false],["6","27","١٧",true,[],false],["7","28","١٨",false,["سالروز عملیات مروارید و روز نیروی دریایی ارتش"],false],["8","29","١٩",false,[],false],["9","30","٢٠",false,["جشن آذرگان ،آذر روز","ولادت حضرت فاطمه زهرا (س) و روز مادر[ ۲۰ جمادی الثانیه ]"],false],["10","01","٢١",false,["روز جهانی ایدز[ December 1 ]"],false],["11","02","٢٢",false,[],false],["12","03","٢٣",false,["روز جهانی معلولان (کم‌توانان)[ December 3 ]"],false],["13","04","٢٤",true,["روز صنعت بیمه"],false],["14","05","٢٥",false,[],false],["15","06","٢٦",false,["روز حسابدار"],false],["16","07","٢٧",false,[],false],["17","08","٢٨",false,[],false],["18","09","٢٩",false,[],false],["19","10","٣٠",false,["روز جهانی حقوق بشر[ December 10 ]"],false],["20","11","٠١",true,["ولادتامام محمد باقر (ع)[ ۱ رجب ]","روز جهانی کوهستان[ December 11 ]"],false],["21","12","٠٢",false,[],false],["22","13","٠٣",false,["شهادت امام علی النقی (ع)[ ۳ رجب ]"],false],["23","14","٠٤",false,[],false],["24","15","٠٥",false,[],false],["25","16","٠٦",false,["روز پژوهش و فناوری"],false],["26","17","٠٧",false,[],false],["27","18","٠٨",true,[],false],["28","19","٠٩",false,[],false],["29","20","١٠",false,["ولادت امام محمد تقی (ع)[ ۱۰ رجب ]"],false],["30","21","١١",false,["جشن شب یلدا، شب چلّه"],false],["1","22","١٢",false,[],true],["2","23","١٣",true,[],true],["3","24","١٤",false,[],true],["4","25","١٥",true,[],true]],

[["28","19","٠٩",false,[],true],["29","20","١٠",false,[],true],["30","21","١١",false,[],true],["1","22","١٢",false,["روز میلاد خورشید؛ جشن خرم روز، نخستین جشن دیگان"],false],["2","23","١٣",true,["ولادت امام علی (ع) و روز پدر[ ۱۳ رجب ]"],false],["3","24","١٤",false,["سالروز عملیات کربلای 4 [1365 خورشیدی]"],false],["4","25","١٥",true,["وفات حضرت زینب (س)[ ۱۵ رجب ]","جشن کریسمس[ December 25 ]","روز بزرگداشت دوستی[ December 25 ]"],false],["5","26","١٦",false,["زمین لرزه ی بم [1382 خورشیدی]","سالروز شهادت اَشو زرتشت، اَبَراِنسان بزرگ تاریخ"],false],["6","27","١٧",false,[],false],["7","28","١٨",false,[],false],["8","29","١٩",false,["دی به آذر روز، دومین جشن دیگان","روز بزرگداشت یعقوب لیث صفاری (رادمان پورماهک) نخستین پادشاه ایرانی پس از اسلام"],false],["9","30","٢٠",false,["اعدام میهن‌پرستان آذری در تبریز توسط قوای اشغالگر روس [1290 خورشیدی]"],false],["10","31","٢١",false,[],false],["11","01","٢٢",true,["جشن آغاز سال نو میلادی[ January 1 ]"],false],["12","02","٢٣",false,["روز حافظ"],false],["13","03","٢٤",false,["شهادت سردار حاج قاسم سلیمانی [1398 خورشیدی]"],false],["14","04","٢٥",false,["شهادت امام موسی کاظم (ع)[ ۲۵ رجب ]"],false],["15","05","٢٦",false,["دی به مهر روز، سومین جشن دیگان"],false],["16","06","٢٧",true,["مبعث رسول اکرم (ص)[ ۲۷ رجب ]","غرق شدن کشتی سانچی [1396 خورشیدی]"],false],["17","07","٢٨",false,[],false],["18","08","٢٩",true,["شلیک به پرواز 752 هواپیمایی اوکراین [1398 خورشیدی]"],false],["19","09","٣٠",false,["درگذشت اکبر هاشمی رفسنجانی [1395 خورشیدی]"],false],["20","10","٠١",false,["قتل امیرکبیر به دستور ناصرالدین شاه قاجار [1230 خورشیدی]"],false],["21","11","٠٢",false,[],false],["22","12","٠٣",false,["ولادت سالار شهیدان، امام حسین (ع) و روز پاسدار[ ۳ شعبان ]"],false],["23","13","٠٤",false,["دی به دین روز، چهارمین جشن دیگان","ولادت حضرت ابوالفضل العباس (ع) و روز جانباز[ ۴ شعبان ]"],false],["24","14","٠٥",false,["ولادت امام زین العابدین (ع)[ ۵ شعبان ]"],false],["25","15","٠٦",true,[],false],["26","16","٠٧",false,[],false],["27","17","٠٨",false,[],false],["28","18","٠٩",false,[],false],["29","19","١٠",false,[],false],["30","20","١١",false,["ولادت حضرت علی اکبر (ع) و روز جوان[ ۱۱ شعبان ]","آتش‌سوزی و فروریختن ساختمان پلاسکو [1395 خورشیدی]"],false],["1","21","١٢",false,[],true],["2","22","١٣",true,[],true]],

[["26","16","٠٧",false,[],true],["27","17","٠٨",false,[],true],["28","18","٠٩",false,[],true],["29","19","١٠",false,[],true],["30","20","١١",false,[],true],["1","21","١٢",false,["زادروز فردوسی"],false],["2","22","١٣",true,["بهمن روز، جشن بهمنگان"],false],["3","23","١٤",false,[],false],["4","24","١٥",true,["ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان[ ۱۵ شعبان ]"],false],["5","25","١٦",false,[],false],["6","26","١٧",false,["بزرگداشت صفی‌الدین اُرمَوی و روز موسیقی ایرانی"],false],["7","27","١٨",false,[],false],["8","28","١٩",false,[],false],["9","29","٢٠",true,[],false],["10","30","٢١",false,["جشن سده، گرامیداشتِ کشف آتش به دستِ هوشنگ شاه"],false],["11","31","٢٢",false,[],false],["12","01","٢٣",false,["بازگشت امام خمینی (ره) به ایران"],false],["13","02","٢٤",false,[],false],["14","03","٢٥",false,[],false],["15","04","٢٦",false,["جشن میانه زمستان"],false],["16","05","٢٧",true,[],false],["17","06","٢٨",false,[],false],["18","07","٢٩",false,[],false],["19","08","٠١",false,["روز نیروی هوایی"],false],["20","09","٠٢",false,[],false],["21","10","٠٣",false,[],false],["22","11","٠٤",true,["پیروزی انقلاب اسلامی","حمله به سفارت روسیه و قتل گریبایدوف سفیر روسیه تزاری در ایران[ February 11 ]"],false],["23","12","٠٥",true,[],false],["24","13","٠٦",false,[],false],["25","14","٠٧",false,["جشن ولنتاین[ February 14 ]"],false],["26","15","٠٨",false,[],false],["27","16","٠٩",false,[],false],["28","17","١٠",false,[],false],["29","18","١١",false,["جشن سپندارمذگان و روز عشق","فاجعه انفجار قطار نیشابور [1382 خورشیدی]"],false],["30","19","١٢",true,[],false]],

[["1","20","١٣",false,[],false],["2","21","١٤",false,[],false],["3","22","١٥",false,["ولادت امام حسن مجتبی (ع)[ ۱۵ رمضان ]"],false],["4","23","١٦",false,[],false],["5","24","١٧",false,["روز بزرگداشت خواجه نصیر الدین طوسی و روز مهندس"],false],["6","25","١٨",false,["شب قدر[ ۱۸ رمضان ]"],false],["7","26","١٩",true,["ضربت خوردن حضرت علی (ع)[ ۱۹ رمضان ]","سالروز استقلال کانون وکلای دادگستری و روز وکیل مدافع"],false],["8","27","٢٠",false,[],false],["9","28","٢١",true,["شهادت حضرت علی(ع)[ ۲۱ رمضان ]"],false],["10","01","٢٢",false,["شب قدر[ ۲۲ رمضان ]"],false],["11","02","٢٣",false,[],false],["12","03","٢٤",false,[],false],["13","04","٢٥",false,[],false],["14","05","٢٦",true,[],false],["15","06","٢٧",false,["روز درختکاری"],false],["16","07","٢٨",false,[],false],["17","08","٢٩",false,["روزجهانی زنان[ March 8 ]"],false],["18","09","٣٠",false,[],false],["19","10","٠١",true,["عید سعید فطر[ ۱ شوال ]"],false],["20","11","٠٢",true,["تعطیل به مناسبت عید سعید فطر[ ۲ شوال ]"],false],["21","12","٠٣",true,[],false],["22","13","٠٤",false,[],false],["23","14","٠٥",false,["روز جهانی عدد پیπ[ March 14 ]"],false],["24","15","٠٦",false,[],false],["25","16","٠٧",false,["پایان سرایش شاهنامه","روز بزرگداشت اختر چرخ ادب، پروین اعتصامی"],false],["26","17","٠٨",false,[],false],["27","18","٠٩",false,[],false],["28","19","١٠",true,[],false],["29","20","١١",true,["روز ملی شدن صنعت نفت ایران","روز جهانی شادی[ March 20 ]"],false],["1","21","١٢",true,[],true],["2","22","١٣",true,[],true],["3","23","١٤",true,[],true],["4","24","١٥",true,[],true],["5","25","١٦",false,[],true],["6","26","١٧",true,[],true]],

];

const metaYear = {
    year: 1405,
    metaYear: [
        "March - April 2026 | شوال - ذوالقعده ١٤٤٧",
        "April - May 2026 | ذوالقعده - ذوالحجه ١٤٤٧",
        "May - June 2026 | ذوالحجه - محرم ١٤٤٧ ١٤٤٨",
        "June - July 2025 | محرم - صفر ١٤٤٨",
        "July - August 2026 | صفر - ربیع الاول ١٤٤٨",
        "August - September 2026 | ربیع الاول - ربیع الثانی ١٤٤٨",
        "September - October 2026 | ربیع الثانی - جمادی الاول ١٤٤٨",
        "October - November 2026 | جمادی الاول - جمادی الثانیه ١٤٤٨",
        "November - December 2026 | جمادی الثانیه - رجب ١٤٤٨",
        "December - January 2026 2027 | رجب - شعبان ١٤٤٨",
        "January - February 2027 | شعبان - رمضان ١٤٤٨",
        "February - March 2027 | رمضان - شوال ١٤٤٨",
    ]
}

const cssProperty = {

    "spring": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #5e991a;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #5e991a !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #5e991a !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #5e991a !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #5e991a;",
            ]
        }
    ],

    "summer": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #4caf50 ;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #4caf50  !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #4caf50  !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #4caf50  !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #4caf50 ;",
            ]
        }
    ],

    "fall": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #ff9800;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #ff9800 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #ff9800 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #ff9800 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #ff9800;",
            ]
        }
    ],

    "winter": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #0984e3;",
                "color: white;",
            ]
        },

        {
            selector: ".active-season",
            property: [
                "background-color: #0984e3 !important;",
                "color:white !important;",
            ]
        },

        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #0984e3 !important;"
            ]
        },

        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #0984e3 !important;",
            ]
        },

        {
            selector: ".year-meta, .year",
            property: [
                "color: #0984e3;",
            ]
        }
    ]
};